import unittest

# Функціональність, що має задовільняти тесту:
def add_numbers(a, b):
    return a + b

# Тест, якому має задовільняти майбутня функціональність:
class TestAddNumbers(unittest.TestCase):
    def test_add_numbers(self):
        result = add_numbers(2, 3)
        self.assertEqual(result, 6) # Перевіряємо, що результат дорівнює 5

if __name__ == '__main__':
    unittest.main()

# Підхід TDD - розробили спочатку тест, який описує очікувану поведінку, а потім написали функціональний код, який задовольняє цей тест. Це дозволяє нам переконатися, що наша функціональність працює правильно та відповідає очікуванням.